can this be fixed please? Just moved from G&ast;d&ast;ddy (API now a feature to be paid extra) to desec and terraform/tofu fails on first run.
It should not be very uncommon to add records from dynamic other resources.
my code:

```
resource "desec_rrset" "node_dns" {
  for_each = {
    for s in concat(hcloud_server.talos_cp, hcloud_server.talos_wk) : s.name => s
  }
  domain     = var.dns_zone
  subname    = format("%s.%s", each.value.name, local.rel_domain)
  records    = [each.value.ipv4_address]
  type       = "A"
  ttl        = 3600
  depends_on = [hcloud_server.talos_cp]
}
```

```
  # desec_rrset.node_dns["cp01"] will be created
  + resource "desec_rrset" "node_dns" {
      + created = (known after apply)
      + domain  = "mydomain.tld"
      + id      = (known after apply)
      + name    = (known after apply)
      + subname = "cp01.whatever.this"
      + ttl     = 3600
      + type    = "A"
    }
```
```
│ Error: Provider produced inconsistent final plan
│ 
│ When expanding the plan for desec_rrset.node_dns["cp03"] to include new values learned so far during apply, provider
│ "registry.opentofu.org/valodim/desec" produced an invalid new value for .records: was null, but now
│ cty.SetVal([]cty.Value{cty.StringVal("1.2.3.4")}).
│ 
│ This is a bug in the provider, which should be reported in the provider's own issue tracker.
╵
```
second successful run:
```
  # desec_rrset.node_dns["cp01"] will be created
  + resource "desec_rrset" "node_dns" {
      + created = (known after apply)
      + domain  = "mydomain.tld"
      + id      = (known after apply)
      + name    = (known after apply)
      + records = [
          + "1.2.3.4",
        ]
      + subname = "cp01.whatever.this"
      + ttl     = 3600
      + type    = "A"
    }

```